I dont think this is properly resolved yet @jhutchings1 - so closure of this one comes a bit as a surprise. 

Using updated provider now ( 5.7.1 ) and still getting diffs - this is just one of the examples. Happens even after apply of the changes ( more records are still affected 

```
  # cloudflare_dns_record.cname_selector2_domainkey_acme_ai will be updated in-place
  ~ resource "cloudflare_dns_record" "cname_selector2_domainkey_acme_ai" {
      ~ comment_modified_on = "2025-05-10T14:39:35Z" -> (known after apply)
      ~ content             = "selector2-acme-ai._domainkey.acmeco.onmicrosoft.com" -> "selector2-acme-ai._domainkey.acmeCo.onmicrosoft.com"
      ~ created_on          = "2025-05-10T14:34:35Z" -> (known after apply)
        id                  = "a******e"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-06-22T08:33:18Z" -> (known after apply)
        name                = "selector2._domainkey.acme.ai"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          ~ flatten_cname = false -> (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }
```